// ------------------------------------------------------------------------------
// -----  EVENT  ----------------------------------------------------------------
//   ※　わざわざ変数の型が書かれているけど、ぶっちゃけ、特に意味ないです。
//       必要なのは、変数の個数。
// ------------------------------------------------------------------------------

export const EventList = 
{
    // プラグインロード
	"PluginLoaded": [ "plugindata" ],
    // プラグインアンロード
    /*
	"PluginUnLoaded": [ "plugindata" ],
    
    // ソフト起動時
    "SoftStart": [ "plugindata" ],
    // ソフト終了時
	"SoftClose": [ "plugindata" ],

    // ゲーム起動時
	"GameStart": [ "plugindata" ],
    // ゲーム終了時
	"GameEnd": [ "plugindata" ],
    */
}